Repository: SamKotlinFisher/smartwifi_ios_sdk
Catalog: smartwifi_ios_sdk/Classes/Localizations/*.lproj/SWFLocalizable.strings
Languages: ru

source: Mapping object data error
ru: Ошибка декодирования модели с data

# saving_data_error
source: Saving data procces error. An error occurred while caching the configs
ru: Ошибка кодирования модели в data

source: Session object is corrupted
ru: Объект сессии поврежден

# wifi_module_switch_off
source: You should switch on wifi module before connecting
ru: У вас выключен модуль Wi-Fi, откройте настройки и включите его

# session_is_not_configured
source: Session is not configured. Please configure session before start
ru: Сессия не настроена. Необходимо настроить сессию перед началом использования

source: No configs in cache memory
ru: Нет сохраненных конфигураций

source: Empty response configs data
ru: Полученный список конфигураций пустой

# priority_is_incorrect
source: Config has no priority or priority is incorrect
ru: Приоритет конфигурации отсутствует или неверный

# can_not_find_wifi_network
source: The device did not connect to this Wi-Fi network
ru: Устройство не подключилось к данной Wi-Fi сети

source: Unable to join the network
ru: Wi-Fi сеть не обнаружена по близости

source: Not connected previously
ru: Не был подключен ранее

# unknown_error
source: An unknown error occurred
ru: Произошла неизвестная ошибка

# configuration_is_invalid
source: The Wi-Fi configuration is invalid
ru: Конфигурация Wi-Fi недействительна

# ssid_string_is_invalid
source: The given SSID string is invalid
ru: Данная строка SSID недействительна

# wpa_wpa2_personal_passphrase_is_invalid
source: The given WPA/WPA2 Personal passphrase is invalid
ru: Персональный пароль WPA/WPA2 недействительный

# wep_passphrase_is_invalid
source: The given WEP passphrase is invalid
ru: Данная WEP пароль недействительный

source: Invalid EAP Settings
ru: Неверные EAP настройки

source: Invalid Hotspot 2.0 Settings
ru: Неверные Hotspot 2.0 настройки.

# hotspot_2_0_domain_name_is_invalid
source: The given Hotspot 2.0 domain name is invalid
ru: Данное Hotspot 2.0 доменное имя недействительно

# failed_to_get_user_approval
source: Failed to get the user's approval to add a new configuration
ru: Не удалось получить одобрение пользователя на добавление новой конфигурации

# internal_error
source: An internal error was encountered
ru: Произошла внутренняя ошибка

# previous_request_is_pending
source: Previous request by the calling application is pending
ru: Предыдущий запрос вызывающего приложения находится на рассмотрении

# application_cannot_modify_system_configuration
source: The calling application cannot modify the System(MDM/Carrier) configuration
ru: Вызывающее приложение не может изменять конфигурацию системы (MDM / оператор связи)

# joinOnce_option_is_not_support
source: JoinOnce option is not support for EAP configuration
ru: Параметр JoinOnce не поддерживается EAP конфигурацией

# already_associated
source: Wi-Fi is already associated
ru: Wi-Fi уже подключен

# application_is_not_in_foreground
source: The application is not in the foreground
ru: Приложение не активное

# ssid_prefix_string_is_invalid
source: The given SSID Prefix string is invalid
ru: Данная строка префикса SSID недействительна
